SET STATISTICS TIME ON; 
go

SET STATISTICS PROFILE on
go

--4.1.1) высокая селективность

select * from Статистика
where ДлительностьПроживания = 1


--4.1.2) низкая селективность
select * from Статистика
where ДлительностьПроживания = 15


--4.1.3) кластеризованный индекс
select * from Статистика
where Статистика.id = 20015

--==========================================================
select СуммаЗаПроживание from Статистика
where СуммаЗаПроживание > 100000


select ДлительностьПроживания from Статистика
where ДлительностьПроживания > 20
group by ДлительностьПроживания

--====================================================================
CREATE STATISTICS [S_duration] ON [dbo].[Статистика]([ДлительностьПроживания])
GO


CREATE STATISTICS [S_sum] ON [dbo].[Статистика]([СуммаЗаПроживание])
GO

--====================================================================


DROP STATISTICS [dbo].[Статистика].[S_duration]
GO

DROP STATISTICS [dbo].[Статистика].[S_sum]
GO

--====================================================================

CREATE INDEX IX_Duration ON Статистика ([ДлительностьПроживания]); 
CREATE INDEX IX_Sum ON Статистика ([СуммаЗаПроживание]);

--====================================================================

drop index IX_Duration ON Статистика 
drop index IX_Sum ON Статистика 

--====================================================================
CREATE STATISTICS [S_duration] ON [dbo].[Статистика]([ДлительностьПроживания])
GO

CREATE STATISTICS [S_sum] ON [dbo].[Статистика]([СуммаЗаПроживание])
GO

--====================================================================


